HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxHssl_bf.h
/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.TTEEN */
#define IFX_HSSL_MFLAGSEN_TTEEN_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.TTEEN */
#define IFX_HSSL_MFLAGSEN_TTEEN_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.TTEEN */
#define IFX_HSSL_MFLAGSEN_TTEEN_OFF (4)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.UNEXPECTEDEN */
#define IFX_HSSL_MFLAGSEN_UNEXPECTEDEN_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.UNEXPECTEDEN */
#define IFX_HSSL_MFLAGSEN_UNEXPECTEDEN_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.UNEXPECTEDEN */
#define IFX_HSSL_MFLAGSEN_UNEXPECTEDEN_OFF (12)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.CRCES */
#define IFX_HSSL_MFLAGSSET_CRCES_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.CRCES */
#define IFX_HSSL_MFLAGSSET_CRCES_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.CRCES */
#define IFX_HSSL_MFLAGSSET_CRCES_OFF (25)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.IMBS */
#define IFX_HSSL_MFLAGSSET_IMBS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.IMBS */
#define IFX_HSSL_MFLAGSSET_IMBS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.IMBS */
#define IFX_HSSL_MFLAGSSET_IMBS_OFF (19)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.INIS */
#define IFX_HSSL_MFLAGSSET_INIS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.INIS */
#define IFX_HSSL_MFLAGSSET_INIS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.INIS */
#define IFX_HSSL_MFLAGSSET_INIS_OFF (31)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.ISBS */
#define IFX_HSSL_MFLAGSSET_ISBS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.ISBS */
#define IFX_HSSL_MFLAGSSET_ISBS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.ISBS */
#define IFX_HSSL_MFLAGSSET_ISBS_OFF (20)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.MAVS */
#define IFX_HSSL_MFLAGSSET_MAVS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.MAVS */
#define IFX_HSSL_MFLAGSSET_MAVS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.MAVS */
#define IFX_HSSL_MFLAGSSET_MAVS_OFF (21)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.NACKS */
#define IFX_HSSL_MFLAGSSET_NACKS_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.NACKS */
#define IFX_HSSL_MFLAGSSET_NACKS_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.NACKS */
#define IFX_HSSL_MFLAGSSET_NACKS_OFF (0)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.PIE1S */
#define IFX_HSSL_MFLAGSSET_PIE1S_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.PIE1S */
#define IFX_HSSL_MFLAGSSET_PIE1S_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.PIE1S */
#define IFX_HSSL_MFLAGSSET_PIE1S_OFF (23)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.PIE2S */
#define IFX_HSSL_MFLAGSSET_PIE2S_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.PIE2S */
#define IFX_HSSL_MFLAGSSET_PIE2S_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.PIE2S */
#define IFX_HSSL_MFLAGSSET_PIE2S_OFF (24)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.SRIES */
#define IFX_HSSL_MFLAGSSET_SRIES_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.SRIES */
#define IFX_HSSL_MFLAGSSET_SRIES_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.SRIES */
#define IFX_HSSL_MFLAGSSET_SRIES_OFF (22)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TEOS */
#define IFX_HSSL_MFLAGSSET_TEOS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TEOS */
#define IFX_HSSL_MFLAGSSET_TEOS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TEOS */
#define IFX_HSSL_MFLAGSSET_TEOS_OFF (30)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TIMEOUTS */
#define IFX_HSSL_MFLAGSSET_TIMEOUTS_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TIMEOUTS */
#define IFX_HSSL_MFLAGSSET_TIMEOUTS_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TIMEOUTS */
#define IFX_HSSL_MFLAGSSET_TIMEOUTS_OFF (8)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TMBS */
#define IFX_HSSL_MFLAGSSET_TMBS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TMBS */
#define IFX_HSSL_MFLAGSSET_TMBS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TMBS */
#define IFX_HSSL_MFLAGSSET_TMBS_OFF (18)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TSES */
#define IFX_HSSL_MFLAGSSET_TSES_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TSES */
#define IFX_HSSL_MFLAGSSET_TSES_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TSES */
#define IFX_HSSL_MFLAGSSET_TSES_OFF (28)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TTES */
#define IFX_HSSL_MFLAGSSET_TTES_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TTES */
#define IFX_HSSL_MFLAGSSET_TTES_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TTES */
#define IFX_HSSL_MFLAGSSET_TTES_OFF (4)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.UNEXPECTEDS */
#define IFX_HSSL_MFLAGSSET_UNEXPECTEDS_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.UNEXPECTEDS */
#define IFX_HSSL_MFLAGSSET_UNEXPECTEDS_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.UNEXPECTEDS */
#define IFX_HSSL_MFLAGSSET_UNEXPECTEDS_OFF (12)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.SUS_P */
#define IFX_HSSL_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.SUS_P */
#define IFX_HSSL_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.SUS_P */
#define IFX_HSSL_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_LEN (1)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_OFF (3)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_LEN (1)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_OFF (2)

